window.logData = {
  "latestVersion": "v2.0.0",
  "logs": [
    {
      "version": "v2.0.0",
      "date": "2026-08-30",
      "content": [
        "新增内部流式下载",
        "新增免责声明确认",
        "新增宠物",
        "UI/UX重做全新视觉升级"
      ]
    },
    {
      "version": "v1.4.0",
      "date": "2026-05-24",
      "content": [
        "新增跳转网站和新卡片样式",
        "修复了一些已知bug"
      ]
    },
    {
      "version": "v1.3.0",
      "date": "2026-04-06",
      "content": [
        "新增独立更新日志弹窗，支持往期更新折叠/展开",
      ]
    },
    {
      "version": "v1.2.0",
      "date": "2026-03-21",
      "content": [
        "新增赞赏支持弹窗，微信/支付宝双渠道",
        "优化回到顶部按钮，增加滚动进度环",
        "新增更多动画，免责声明样式变更、新增站点运行时长模块与备案"
      ]
    },
    {
      "version": "v1.1.3",
      "date": "2026-01-30",
      "content": [
        "新增免责声明"
      ]
    },
    {
      "version": "v1.1.2",
      "date": "2026-01-29",
      "content": [
        "移除反馈"
      ]
    },
    {
      "version": "v1.1.1",
      "date": "2026-01-26",
      "content": [
        "新增反馈"
      ]
    },
    {
      "version": "v1.1.0",
      "date": "2026-01-23",
      "content": [
        "完成官网基础架构搭建",
        "产品展示模块，支持多产品配置",
        "联系我们、加入QQ群"
      ]
    }
  ]
};
